{
  "nombre": "Emulador-terminal-integrasion",
  "version_actual": "0.10.10",
  "estado": "en prueba",
  "descripcion": "Proyecto personal en Python desarrollado como práctica de programación. Comenzó como un script simple en un solo archivo y evolucionó hacia una estructura modular con interfaz en terminal, validaciones robustas y persistencia de datos.",
  "resumen_del_camino": [
    "Inicio con un solo archivo Python y lógica básica",
    "Implementación de menús, juegos simples y sistema de vidas",
    "Mejoras en la interfaz de terminal con colores y bordes ASCII",
    "Refactorización a funciones reutilizables",
    "Separación en módulos y paquetes",
    "Incorporación de chat básico",
    "Persistencia de datos y validaciones avanzadas"
  ],
  "historial_versiones": [
    {
      "version": "0.1.0",
      "nota": "Primera versión funcional con menú simple, sistema de vidas y juegos básicos en un solo archivo."
    },
    {
      "version": "0.3.0",
      "nota": "Refactorización inicial: funciones reutilizables, mejoras visuales y mensajes con más personalidad."
    },
    {
      "version": "0.6.0",
      "nota": "Separación del proyecto en múltiples archivos y carpetas, inicio de la modularidad real."
    },
    {
      "version": "0.8.0",
      "nota": "Persistencia de datos y validaciones más completas."
    },
    {
      "version": "0.9.0",
      "nota": "Proyecto estable para pruebas: interfaz pulida, mejor manejo de errores y estructura clara."
    },
    {
    	  "version": "0.10.0",
    	    "nota": "Se incorpora un sistema de configuración centralizada que permite consultar la versión del proyecto y su información general."
    	    
    },
    {
          "version": "0.10.1",
            "nota": "se modificaron funciones y se hizo una reorganización de imports y de la estructura, separando y optimizando funciones para una apariencia más limpia"
     },
     {
           "version": "0.10.2",
            "nota": "se crearon nuevos paquetes y módulos para las modificaciones hechas anteriormente. se solucionaron errores graves provocados por la reorganización de los imports en UI_principal.py. esta reorganización provocó varios errores importantes, como funciones que se ejecutaban antes del menú sin ser llamadas, entre otros errores que fueron detectados y corregidos"
    },
    {
           "version": "0.10.3",
            "nota": "se arreglaron errores relacionados con colores  de colorama"
    },
    {
           "version": "0.10.4",
            "nota": "reorganizacion de los datos en json, separando dialogos y claves"
    },
         {
           "version": "0.10.5",
            "nota": "se reorganizo los paquetes de matematica y juego separando logica de la UI"
    },
         {
           "version": "0.10.6",
            "nota": "se encotraron bugs despues de la reorganización de los modulos de matematica y juegos necesitando correcciones en el codigo"
    },
         {
           "version": "0.10.7",
            "nota": "se separaron las configuraciones y se reoganiso los imports"
    },
         {
           "version": "0.10.10",
            "nota": "se creo nuevas carpetas o paquetes para cada funcion o especialidad del proyecto"
    }
    
    
    
  ]
}



